# Задача 2: - HARD необязательная, идет за 3 обязательных Найдите сумму цифр любого вещественного или целого числа. 
# Можно использовать decimal. Через строку решать нельзя. 


# решение через математику.
# почти не отличается от решения легкой версии задачи

from decimal import Decimal

a = Decimal(input("Введите любое дробное число: "))

temp=1
sum=0

while temp!=0:
    a=a*10
    temp= a%10
    
while a>0:
    sum+=a%10
    a=a//10
print(f'Сумма всех цифр дробного числа равна: {int(sum)}')



# Решение через строку потому что так интереснее
# Было сложно придумать как убрать точку
# Для этого мне потребовалось больше понимания языка и логики работы

# a = input("Введите любое дробное число: ")
# a = str(a)
# a = list(a)
# index = -1
# sum = 0

# for i in a:
#     if (i != '.') and (i!=','):
#         index += 1
#         sum += int(a[index])
#     else:
#         index += 1

# print(f'Сумма всех цифр дробного числа равна {sum}')